Tekla Open API Reference for Tekla Structures 2025
RectangleBoundingBox.UpperLeft Property
 The upper left corner point of the bounding box.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point UpperLeft { get; }
Public ReadOnly Property UpperLeft As Point
	Get
Property Value
Type: Point
See Also
Reference
RectangleBoundingBox Class
Tekla.Structures.Drawing Namespace